//Вопросы и ответы
import { TranslationKeys } from "./DataInterfaces";

// Интерфейс для вопросов
export interface QuestionItem {
  id: number;
  topDescr: TranslationKeys;
  question: TranslationKeys;
  options: QuestionOption[];
}

// Интерфейс для варианта ответа
export interface QuestionOption {
  id: number;
  topDescr: TranslationKeys;
  text: TranslationKeys;
  image: TranslationKeys;
  value: number;
  messageTitle: TranslationKeys;
  messageDescr: TranslationKeys;
}

const questions: QuestionItem[] = [
  {
    id: 1, // id - вопроса
    topDescr: {
      ru: "Какое платье невесты выберем?", // текст сверху на русском
      kz: "Қандай қалыңдық көйлегін таңдаймыз?", // текст сверху на кахаском
    },
    question: {
      ru: "Какое платье невесты выберем?", // вопрос сверху на русском
      kz: "Қандай қалыңдық көйлегін таңдаймыз?", // вопрос сверху на кахаском
    },
    options: [
      // ответы
      {
        id: 1, // id - ответа
        topDescr: {
          ru: "Это Феррари из мира платьев.", // текст сверху на русском
          kz: "Бұл – көйлектер әлеміндегі Феррари.", // текст сверху на кахаском
        },
        text: {
          ru: "Это Феррари из мира платьев.", // текст самого вопроса на русском
          kz: "Бұл – көйлектер әлеміндегі Феррари.", // текст самого вопроса на кахаском
        },
        // image: "/images/q1_opt1.jpg",  // картинка вопроса, папка с картинками тут /images
        image: {
          ru: "/images/q1_opt1.jpg",
          kz: "/images/q1_opt1.jpg",
        },
        value: 0, // стоимость вопроса
        messageTitle: {
          ru: "Это Феррари из мира платьев.", // заголовок на странице ответа на русском
          kz: "Бұл – көйлектер әлеміндегі Феррари.", // заголовок на странице ответа на кахаском
        },
        messageDescr: {
          ru: "В этом платье вы словно солнце, излучаете лучи богатства.", // текст на странице ответа на русском
          kz: "Бұл көйлекпен Сіз байлық сәулесін шашатын күн сияқтысыз.", // текст на странице ответа на кахаском
        },
      },
      {
        id: 2,
        topDescr: {
          ru: "Купим в обычном магазине и тогда платье можно носить хоть каждый день.",
          kz: "Көйлекті кәдімгі дүкеннен сатып аламыз, сонда оны күнде кисе де болады.",
        },
        text: {
          ru: "Купим в обычном магазине и тогда платье можно носить хоть каждый день.",
          kz: "Көйлекті кәдімгі дүкеннен сатып аламыз, сонда оны күнде кисе де болады.",
        },
        image: {
          ru: "/images/q1_opt2.jpg",
          kz: "/images/q1_opt2.jpg",
        },
        value: 250000,
        messageTitle: {
          ru: "Купим в обычном магазине и тогда платье можно носить хоть каждый день.",
          kz: "Көйлекті кәдімгі дүкеннен сатып аламыз, сонда оны күнде кисе де болады.",
        },
        messageDescr: {
          ru: "Отличное сочетание цены и качества.",
          kz: "Баға мен сапаның тамаша үйлесімі.",
        },
      },
      {
        id: 3,
        topDescr: {
          ru: "Возьмем платье в аренду, всё равно наденем один раз.",
          kz: "Көйлекті жалға аламыз, бәрібір оны бір-ақ рет киеміз ғой.",
        },
        text: {
          ru: "Возьмем платье в аренду, всё равно наденем один раз.",
          kz: "Көйлекті жалға аламыз, бәрібір оны бір-ақ рет киеміз ғой.",
        },
        image: {
          ru: "/images/q1_opt3.jpg",
          kz: "/images/q1_opt3.jpg",
        },
        value: 500000,
        messageTitle: {
          ru: "Возьмем платье в аренду, всё равно наденем один раз.",
          kz: "Көйлекті жалға аламыз, бәрібір оны бір-ақ рет киеміз ғой.",
        },
        messageDescr: {
          ru: "Красивое платье за красивые деньги.",
          kz: "Әдемі ақшаға әдемі көйлек.",
        },
      },
    ],
  },
  {
    id: 2,
    topDescr: {
      ru: "На чем поедем на свадьбу?",
      kz: "Үйлену тойына немен барамыз?",
    },
    question: {
      ru: "На чем поедем на свадьбу?",
      kz: "Үйлену тойына немен барамыз?",
    },
    options: [
      {
        id: 1,
        topDescr: {
          ru: "Лимузин длиннее, чем пробки в Алматы.",
          kz: "Алматыдағы кептелістен де ұзынырақ лимузин.",
        },
        text: {
          ru: "Лимузин длиннее, чем пробки в Алматы.",
          kz: "Алматыдағы кептелістен де ұзынырақ лимузин.",
        },
        image: {
          ru: "/images/q2_opt1.jpg",
          kz: "/images/q2_opt1.jpg",
        },
        value: 0,
        messageTitle: {
          ru: "Лимузин длиннее, чем пробки в Алматы.",
          kz: "Алматыдағы кептелістен де ұзынырақ лимузин.",
        },
        messageDescr: {
          ru: "Каждый человек смотрит вам в след и завидует роскоши.",
          kz: "Оған әрбір адам қызыға қарайды.",
        },
      },
      {
        id: 2,
        topDescr: {
          ru: "Кортеж из машин наших друзей. Пусть весь город знает о нашем счастье!",
          kz: "Достарымыздың көліктерінен құралған кортеж. Біздің бақытымыз туралы бүкіл қала білсін!",
        },
        text: {
          ru: "Кортеж из машин наших друзей. Пусть весь город знает о нашем счастье!",
          kz: "Достарымыздың көліктерінен құралған кортеж. Біздің бақытымыз туралы бүкіл қала білсін!",
        },
        image: {
          ru: "/images/q2_opt2.jpg",
          kz: "/images/q2_opt2.jpg",
        },
        value: 250000,
        messageTitle: {
          ru: "Кортеж из машин наших друзей. Пусть весь город знает о нашем счастье!",
          kz: "Достарымыздың көліктерінен құралған кортеж. Біздің бақытымыз туралы бүкіл қала білсін!",
        },
        messageDescr: {
          ru: "Сегодня вы самая важная персона на этой дороге!",
          kz: "Бүгін Сіз осы жолдағы ең маңызды адамсыз!",
        },
      },
      {
        id: 3,
        topDescr: {
          ru: "Украсим машину друга и поедем с ветерком.",
          kz: "Досымыздың көлігін безендіріп, самал желдей есеміз.",
        },
        text: {
          ru: "Украсим машину друга и поедем с ветерком.",
          kz: "Досымыздың көлігін безендіріп, самал желдей есеміз.",
        },
        image: {
          ru: "/images/q2_opt3.jpg",
          kz: "/images/q2_opt3.jpg",
        },
        value: 500000,
        messageTitle: {
          ru: "Украсим машину друга и поедем с ветерком.",
          kz: "Досымыздың көлігін безендіріп, самал желдей есеміз.",
        },
        messageDescr: {
          ru: "Ничто не сближает так, как совместное украшение машины.",
          kz: "Дәл көлікті бірге безендіру сияқты адамдарды ештеңе жақындастыра алмайды.",
        },
      },
    ],
  },
  {
    id: 3,
    topDescr: {
      ru: "Кого пригласиь на свадьбу?",
      kz: "Үйлену тойына кімдерді шақырамыз?",
    },
    question: {
      ru: "Кого позовем на свадьбу?",
      kz: "Үйлену тойына кімдерді шақырамыз?",
    },
    options: [
      {
        id: 1,
        topDescr: {
          ru: "Позовем немере ага подруги  племянника соседа Айман тате.",
          kz: "Айман тәтенің көршісінің жиенінің құрбысының немере ағасын шақырамыз.",
        },
        text: {
          ru: "Позовем немере ага подруги  племянника соседа Айман тате.",
          kz: "Айман тәтенің көршісінің жиенінің құрбысының немере ағасын шақырамыз.",
        },
        image: {
          ru: "/images/q3_opt1.jpg",
          kz: "/images/q3_opt1.jpg",
        },
        value: 0,
        messageTitle: {
          ru: "Позовем немере ага подруги племянника соседа Айман тате.",
          kz: "Айман тәтенің көршісінің жиенінің құрбысының немере ағасын шақырамыз.",
        },
        messageDescr: {
          ru: "С таким количеством гостей можно собрать полный зал в Almaty Arena.",
          kz: "Мұнша қонақ шақырса, Almaty Arena-дағы зал толып кетуі мүмкін.",
        },
      },
      {
        id: 2,
        topDescr: {
          ru: "Позовем примерно 100 человек, это уже в 5 раз меньше, чем планировали родители.",
          kz: "100-ге жуық адамды шақырамыз, бұл ата-анамыздың жоспарлағанынан 5 есе аз.",
        },
        text: {
          ru: "Позовем примерно 100 человек, это уже в 5 раз меньше, чем планировали родители.",
          kz: "100-ге жуық адамды шақырамыз, бұл ата-анамыздың жоспарлағанынан 5 есе аз.",
        },
        image: {
          ru: "/images/q3_opt2.jpg",
          kz: "/images/q3_opt2.jpg",
        },
        value: 300000,
        messageTitle: {
          ru: "Позовем примерно 100 человек, это уже в 5 раз меньше, чем планировали родители.",
          kz: "100-ге жуық адамды шақырамыз, бұл ата-анамыздың жоспарлағанынан 5 есе аз.",
        },
        messageDescr: {
          ru: "Вы не знаете всех гостей, но лучшая подруга мамы точно должна была прийти.",
          kz: "Сіз барлық қонақтарды білмейсіз, бірақ анаңыздың ең жақын құрбысы анық келуі тиіс болатын.",
        },
      },
      {
        id: 3,
        topDescr: {
          ru: "Позовем только самых близких и родных.",
          kz: "Тек ең жақын адамдарымыз бен туыстарымызды шақырамыз.",
        },
        text: {
          ru: "Позовем только самых близких и родных.",
          kz: "Тек ең жақын адамдарымыз бен туыстарымызды шақырамыз.",
        },
        image: {
          ru: "/images/q3_opt3.jpg",
          kz: "/images/q3_opt3.jpg",
        },
        value: 700000,
        messageTitle: {
          ru: "Позовем только самых близких и родных.",
          kz: "Тек ең жақын адамдарымыз бен туыстарымызды шақырамыз.",
        },
        messageDescr: {
          ru: "Что может быть лучше, чем компания из людей которых вы любите?",
          kz: "Өзіңіз жақсы көретін адамдардың ортасында болғаннан артық не болуы мүмкін?",
        },
      },
    ],
  },
  {
    id: 4,
    topDescr: {
      ru: "Как будем развлекать гостей?",
      kz: "Қонақтардың көңілін қалай көтереміз?",
    },
    question: {
      ru: "Как будем развлекать гостей?",
      kz: "Қонақтардың көңілін қалай көтереміз?",
    },
    options: [
      {
        id: 1,
        topDescr: {
          ru: "Пригласим звёзд мирового масштаба и удивим всю страну.",
          kz: "Әлемдік деңгейдегі жұлдыздарды шақырып, бүкіл елді таң қалдырамыз.",
        },
        text: {
          ru: "Пригласим звёзд мирового масштаба и удивим всю страну.",
          kz: "Әлемдік деңгейдегі жұлдыздарды шақырып, бүкіл елді таң қалдырамыз.",
        },
        image: {
          ru: "/images/q4_opt1.jpg",
          kz: "/images/q4_opt1.jpg",
        },
        value: 0,
        messageTitle: {
          ru: "Пригласим звёзд мирового масштаба и удивим всю страну.",
          kz: "Әлемдік деңгейдегі жұлдыздарды шақырып, бүкіл елді таң қалдырамыз.",
        },
        messageDescr: {
          ru: "Мы хотим чтобы о нашей свадьбе говорили из каждого переулка!",
          kz: "Үйлену тойымыздың ел аузында болғанын қалаймыз!",
        },
      },
      {
        id: 2,
        topDescr: {
          ru: "Позовем лучшего тамаду города.",
          kz: "Қаладағы ең жақсы асабаны шақырамыз.",
        },
        text: {
          ru: "Позовем лучшего тамаду города.",
          kz: "Қаладағы ең жақсы асабаны шақырамыз.",
        },
        image: {
          ru: "/images/q4_opt2.jpg",
          kz: "/images/q4_opt2.jpg",
        },
        value: 300000,
        messageTitle: {
          ru: "Позовем лучшего тамаду города.",
          kz: "Қаладағы ең жақсы асабаны шақырамыз.",
        },
        messageDescr: {
          ru: "У него шутки хорошие и конкурсы интересные.",
          kz: "Оның әзілдері жақсы, конкурстары қызық.",
        },
      },
      {
        id: 3,
        topDescr: {
          ru: "Нашим друзьям прямая дорога на шоу талантов. Они точно зажгут эту свадьбу.",
          kz: "Достарымыз – нағыз таланттар шоуына баратын адамдар. Олар бұл тойды дүрілдетіп жібереді.",
        },
        text: {
          ru: "Нашим друзьям прямая дорога на шоу талантов. Они точно зажгут эту свадьбу.",
          kz: "Достарымыз – нағыз таланттар шоуына баратын адамдар. Олар бұл тойды дүрілдетіп жібереді.",
        },
        image: {
          ru: "/images/q4_opt3.jpg",
          kz: "/images/q4_opt3.jpg",
        },
        value: 600000,
        messageTitle: {
          ru: "Нашим друзьям прямая дорога на шоу талантов. Они точно зажгут эту свадьбу.",
          kz: "Достарымыз – нағыз таланттар шоуына баратын адамдар. Олар бұл тойды дүрілдетіп жібереді.",
        },
        messageDescr: {
          ru: "Вы бы только знали как они умеют себя развлекать!",
          kz: "Олардың қалай көңіл көтеретінін білсеңіз ғой!",
        },
      },
    ],
  },
  {
    id: 5, // id - вопроса
    topDescr: {
      ru: "Как запечатлим свадьбу?", // текст сверху на русском
      kz: "Үйлену тойын қалай түсіреміз?", // текст сверху на кахаском
    },
    question: {
      ru: "Как запечатлим свадьбу?", // вопрос сверху на русском
      kz: "Үйлену тойын қалай түсіреміз?", // вопрос сверху на кахаском
    },
    options: [
      // ответы
      {
        id: 1, // id - ответа
        topDescr: {
          ru: "После съемок этой свадьбы можно смело получить «Оскар».", // текст сверху на русском
          kz: "Бұл үйлену тойын түсіргеннен кейін «Оскар» алуға болады.", // текст сверху на кахаском
        },
        text: {
          ru: "После съемок этой свадьбы можно смело получить «Оскар».", // текст самого вопроса на русском
          kz: "Бұл үйлену тойын түсіргеннен кейін «Оскар» алуға болады.", // текст самого вопроса на кахаском
        },
        image: {
          ru: "/images/q5_opt1.jpg",
          kz: "/images/q5_opt1.jpg",
        }, // картинка вопроса, папка с картинками тут /images
        value: 0, // стоимость вопроса
        messageTitle: {
          ru: "После съемок этой свадьбы можно смело получить «Оскар».", // заголовок на странице ответа на русском
          kz: "Бұл үйлену тойын түсіргеннен кейін «Оскар» алуға болады.", // заголовок на странице ответа на кахаском
        },
        messageDescr: {
          ru: "Каждая секунда и каждый момент нашей свадьбы должны быть запечатлены.", // текст на странице ответа на русском
          kz: "Үйлену тойымыздың әрбір секунды, әрбір сәті есте қалуы тиіс.", // текст на странице ответа на кахаском
        },
      },
      {
        id: 2,
        topDescr: {
          ru: "Мобилограф, полный энтузиазма, которого нашла апашка на OXL.",
          kz: "Апашкамыз OXL-тен тапқан құлшынысқа толы мобилограф.",
        },
        text: {
          ru: "Мобилограф, полный энтузиазма, которого нашла апашка на OXL.",
          kz: "Апашкамыз OXL-тен тапқан құлшынысқа толы мобилограф.",
        },
        image: {
          ru: "/images/q5_opt2.jpg",
          kz: "/images/q5_opt2.jpg",
        },
        value: 300000,
        messageTitle: {
          ru: "Мобилограф, полный энтузиазма, которого нашла апашка на OXL.",
          kz: "Апашкамыз OXL-тен тапқан құлшынысқа толы мобилограф.",
        },
        messageDescr: {
          ru: "Как он только не ползал, у него будут отличные кадры.",
          kz: "Ол еңбектеп-еңкейіп жүріп, тамаша кадрлар түсіреді.",
        },
      },
      {
        id: 3,
        topDescr: {
          ru: "Мой брат так круто сфоткал меня во дворе, я думаю он справится и на свадьбе.",
          kz: "Ағам мені аулада суретке жап-жақсы түсіретін, үйлену тойында да түсіре алады деп ойлаймын.",
        },
        text: {
          ru: "Мой брат так круто сфоткал меня во дворе, я думаю он справится и на свадьбе.",
          kz: "Ағам мені аулада суретке жап-жақсы түсіретін, үйлену тойында да түсіре алады деп ойлаймын.",
        },
        image: {
          ru: "/images/q5_opt3.jpg",
          kz: "/images/q5_opt3.jpg",
        },
        value: 500000,
        messageTitle: {
          ru: "Мой брат так круто сфоткал меня во дворе, я думаю он справится и на свадьбе.",
          kz: "Ағам мені аулада суретке жап-жақсы түсіретін, үйлену тойында да түсіре алады деп ойлаймын.",
        },
        messageDescr: {
          ru: "Может он не профессионал, но у него самые душевные кадры.",
          kz: "Ол кәсіби маман болмаса да, жасаған кадрлары көңілден шығады.",
        },
      },
    ],
  },
  {
    id: 6, // id - вопроса
    topDescr: {
      ru: "Кто будет организовывать свадьбу?", // текст сверху на русском
      kz: "Үйлену тойын кім ұйымдастырады?", // текст сверху на кахаском
    },
    question: {
      ru: "Кто будет организовывать свадьбу?", // вопрос сверху на русском
      kz: "Үйлену тойын кім ұйымдастырады?", // вопрос сверху на кахаском
    },
    options: [
      // ответы
      {
        id: 1, // id - ответа
        topDescr: {
          ru: "Обратимся к топовому агентству по организации и проведению свадеб.", // текст сверху на русском
          kz: "Үйлену тойларын ұйымдастырумен және өткізумен айналысатын ең жақсы агенттікке жүгінеміз.", // текст сверху на кахаском
        },
        text: {
          ru: "Обратимся к топовому агентству по организации и проведению свадеб.", // текст самого вопроса на русском
          kz: "Үйлену тойларын ұйымдастырумен және өткізумен айналысатын ең жақсы агенттікке жүгінеміз.", // текст самого вопроса на кахаском
        },
        image: {
          ru: "/images/q6_opt1.jpg",
          kz: "/images/q6_opt1.jpg",
        }, // картинка вопроса, папка с картинками тут /images
        value: 0, // стоимость вопроса
        messageTitle: {
          ru: "Как организует свадьбу?", // заголовок на странице ответа на русском
          kz: "Үйлену тойларын ұйымдастырумен және өткізумен айналысатын ең жақсы агенттікке жүгінеміз.", // заголовок на странице ответа на кахаском
        },
        messageDescr: {
          ru: "Теперь вы ни о чем не переживаете по поводу свадьбы, кроме вашего бюджета.", // текст на странице ответа на русском
          kz: "Енді Сіз үйлену тойыңызда бюджеттен басқа ештеңеге алаңдамайсыз.", // текст на странице ответа на кахаском
        },
      },
      {
        id: 2,
        topDescr: {
          ru: "Наймем команду профессионалов на OXL. Пускай они всё организуют.",
          kz: "OXL-те кәсіби мамандар командасын жалдаймыз. Бәрін солар өздері ұйымдастырсын.",
        },
        text: {
          ru: "Наймем команду профессионалов на OXL. Пускай они всё организуют.",
          kz: "OXL-те кәсіби мамандар командасын жалдаймыз. Бәрін солар өздері ұйымдастырсын.",
        },
        image: {
          ru: "/images/q6_opt2.jpg",
          kz: "/images/q6_opt2_kz.jpg",
        },
        value: 400000,
        messageTitle: {
          ru: "Наймем команду профессионалов на OXL. Пускай они всё организуют.",
          kz: "OXL-те кәсіби мамандар командасын жалдаймыз. Бәрін солар өздері ұйымдастырсын.",
        },
        messageDescr: {
          ru: "Вам пообещали сделать все в лучшем качестве, но вы все равно переживаете.",
          kz: "Олар бәрі жақсы сапада болады деп уәде берсе де, сіз бәрібір уайымдайсыз.",
        },
      },
      {
        id: 3,
        topDescr: {
          ru: "Организуем всё сами, с душой и большой любовью. Точно будет что вспомнить.",
          kz: "Бәрін үлкен сүйіспеншілікпен, жанымызды салып, өзіміз ұйымдастырамыз. Анық есте қаларлықтай болады.",
        },
        text: {
          ru: "Организуем всё сами, с душой и большой любовью. Точно будет что вспомнить.",
          kz: "Бәрін үлкен сүйіспеншілікпен, жанымызды салып, өзіміз ұйымдастырамыз. Анық есте қаларлықтай болады.",
        },
        image: {
          ru: "/images/q6_opt3.jpg",
          kz: "/images/q6_opt3.jpg",
        },
        value: 600000,
        messageTitle: {
          ru: "Организуем всё сами, с душой и большой любовью. Точно будет что вспомнить.",
          kz: "Бәрін үлкен сүйіспеншілікпен, жанымызды салып, өзіміз ұйымдастырамыз. Анық есте қаларлықтай болады.",
        },
        messageDescr: {
          ru: "Да мы потратим больше времени, но зато все будет как мы захотим.",
          kz: "Иә, көбірек уақыт жұмсаймыз, есесіне бәрі өзіміз қалағандай болады.",
        },
      },
    ],
  },
  {
    id: 7, // id - вопроса
    topDescr: {
      ru: "Что на счёт торта?", // текст сверху на русском
      kz: "Тортты не істейміз?", // текст сверху на кахаском
    },
    question: {
      ru: "Что на счёт торта?", // вопрос сверху на русском
      kz: "Тортты не істейміз?", // вопрос сверху на кахаском
    },
    options: [
      // ответы
      {
        id: 1, // id - ответа
        topDescr: {
          ru: "Не знаем, что дороже, этот торт или оплата 20 человек, которые будут его нести.", // текст сверху на русском
          kz: "Торттың өзі қымбатқа түсе ме, әлде оны көтеріп әкелетін 20 адамға төлейтін ақшасы ма, соны білмейміз.", // текст сверху на кахаском
        },
        text: {
          ru: "Не знаем, что дороже, этот торт или оплата 20 человек, которые будут его нести.", // текст самого вопроса на русском
          kz: "Торттың өзі қымбатқа түсе ме, әлде оны көтеріп әкелетін 20 адамға төлейтін ақшасы ма, соны білмейміз.", // текст самого вопроса на кахаском
        },
        image: {
          ru: "/images/q7_opt1.jpg",
          kz: "/images/q7_opt1.jpg",
        }, // картинка вопроса, папка с картинками тут /images
        value: 0, // стоимость вопроса
        messageTitle: {
          ru: "Не знаем, что дороже, этот торт или оплата 20 человек, которые будут его нести.", // заголовок на странице ответа на русском
          kz: "Торттың өзі қымбатқа түсе ме, әлде оны көтеріп әкелетін 20 адамға төлейтін ақшасы ма, соны білмейміз.", // заголовок на странице ответа на кахаском
        },
        messageDescr: {
          ru: "Выше этого торта только Эйфелева башня и то это под вопросом.", // текст на странице ответа на русском
          kz: "Бұл торттан Эйфель мұнарасы ғана биік, әрі оның өзі анық емес.", // текст на странице ответа на кахаском
        },
      },
      {
        id: 2,
        topDescr: {
          ru: "Торт-замок тоже большой, но зато его можно разрезать без стремянки.",
          kz: "Сарай пішінді торт та үлкен, бірақ оны жиылмалы басқышсыз кесуге болады.",
        },
        text: {
          ru: "Торт-замок тоже большой, но зато его можно разрезать без стремянки.",
          kz: "Сарай пішінді торт та үлкен, бірақ оны жиылмалы басқышсыз кесуге болады.",
        },
        image: {
          ru: "/images/q7_opt2.jpg",
          kz: "/images/q7_opt2.jpg",
        },
        value: 200000,
        messageTitle: {
          ru: "Торт-замок тоже большой, но зато его можно разрезать без стремянки.",
          kz: "Сарай пішінді торт та үлкен, бірақ оны жиылмалы басқышсыз кесуге болады.",
        },
        messageDescr: {
          ru: "Лучше, конечно иметь настоящий дворец, но можно и сладкий заказать.",
          kz: "Әрине, нағыз сарайдың болғаны жақсы ғой, бірақ тәттісіне тапсырыс беруге де болады.",
        },
      },
      {
        id: 3,
        topDescr: {
          ru: "Закажем капкейки — получится дешевле и так же сладко.",
          kz: "Капкейктерге тапсырыс береміз — бағасы арзанырақ болып шығады, әрі дәл сондай тәтті.",
        },
        text: {
          ru: "Закажем капкейки — получится дешевле и так же сладко.",
          kz: "Капкейктерге тапсырыс береміз — бағасы арзанырақ болып шығады, әрі дәл сондай тәтті.",
        },
        image: {
          ru: "/images/q7_opt3.jpg",
          kz: "/images/q7_opt3.jpg",
        },
        value: 300000,
        messageTitle: {
          ru: "Закажем капкейки — получится дешевле и так же сладко.",
          kz: "Капкейктерге тапсырыс береміз — бағасы арзанырақ болып шығады, әрі дәл сондай тәтті.",
        },
        messageDescr: {
          ru: "Капкейки легче кусать во время церемонии.",
          kz: "Той кезінде капкейктер жегенге ыңғайлырақ.",
        },
      },
    ],
  },
  {
    id: 8, // id - вопроса
    topDescr: {
      ru: "Что на счёт свадебного путешествия?", // текст сверху на русском
      kz: "Ал үйлену саяхаты ше?", // текст сверху на кахаском
    },
    question: {
      ru: "Что на счёт свадебного путешествия?", // вопрос сверху на русском
      kz: "Ал үйлену саяхаты ше?", // вопрос сверху на кахаском
    },
    options: [
      // ответы
      {
        id: 1, // id - ответа
        topDescr: {
          ru: "Бизнес класс, all inclusive и полный лакшери в любой стране мира.", // текст сверху на русском
          kz: "Бизнес санаты, all inclusive және әлемнің кез келген елінде толық лакшери жасау.", // текст сверху на кахаском
        },
        text: {
          ru: "Бизнес класс, all inclusive и полный лакшери в любой стране мира.", // текст самого вопроса на русском
          kz: "Бизнес санаты, all inclusive және әлемнің кез келген елінде толық лакшери жасау.", // текст самого вопроса на кахаском
        },
        image: {
          ru: "/images/q8_opt1.jpg",
          kz: "/images/q8_opt1.jpg",
        }, // картинка вопроса, папка с картинками тут /images
        value: 0, // стоимость вопроса
        messageTitle: {
          ru: "Бизнес класс, all inclusive и полный лакшери в любой стране мира.", // заголовок на странице ответа на русском
          kz: "Бизнес санаты, all inclusive және әлемнің кез келген елінде толық лакшери жасау.", // заголовок на странице ответа на кахаском
        },
        messageDescr: {
          ru: "Лучший месяц в жизни, но тяжелый год.", // текст на странице ответа на русском
          kz: "Өмірдегі ең жақсы ай, бірақ қиын жыл.", // текст на странице ответа на кахаском
        },
      },
      {
        id: 2,
        topDescr: {
          ru: "Горячие туры - это наш вариант! Летом в Дубай - это будет горячо.",
          kz: "Біздің нұсқамыз – жедел турлар! Дубайда жаз ыстық болады.",
        },
        text: {
          ru: "Горячие туры - это наш вариант! Летом в Дубай - это будет горячо.",
          kz: "Біздің нұсқамыз – жедел турлар! Дубайда жаз ыстық болады.",
        },
        image: {
          ru: "/images/q8_opt2.jpg",
          kz: "/images/q8_opt2.jpg",
        },
        value: 400000,
        messageTitle: {
          ru: "Горячие туры - это наш вариант! Летом в Дубай - это будет горячо.",
          kz: "Біздің нұсқамыз – жедел турлар! Дубайда жаз ыстық болады.",
        },
        messageDescr: {
          ru: "Самое главное не расплавиться от жары.",
          kz: "Ең бастысы – ыстықтан еріп кетпеу.",
        },
      },
      {
        id: 3,
        topDescr: {
          ru: "Снимем домик на берегу Кольсай, насладимся отдыхом вдвоём и рыбку половить можно.",
          kz: " Көлсайдың жағасынан үй жалдап, оңашада рахаттанып демаламыз, әрі балық аулауға да болады.",
        },
        text: {
          ru: "Снимем домик на берегу Кольсай, насладимся отдыхом вдвоём и рыбку половить можно.",
          kz: " Көлсайдың жағасынан үй жалдап, оңашада рахаттанып демаламыз, әрі балық аулауға да болады.",
        },
        image: {
          ru: "/images/q8_opt3.jpg",
          kz: "/images/q8_opt3.jpg",
        },
        value: 400000,
        messageTitle: {
          ru: "Снимем домик на берегу Кольсай, насладимся отдыхом вдвоём и рыбку половить можно.",
          kz: " Көлсайдың жағасынан үй жалдап, оңашада рахаттанып демаламыз, әрі балық аулауға да болады.",
        },
        messageDescr: {
          ru: "Тишина, спокойствие и любимый человек, что может быть лучше?",
          kz: "Тып-тыныш жерде сүйікті адамыңмен бірге уақыт өткізгеннен артық не болуы мүмкін?",
        },
      },
    ],
  },
  {
    id: 9, // id - вопроса
    topDescr: {
      ru: "Сколько свадеб будем играть?", // текст сверху на русском
      kz: "Неше той жасаймыз?", // текст сверху на кахаском
    },
    question: {
      ru: "Сколько свадеб будем играть?", // вопрос сверху на русском
      kz: "Неше той жасаймыз?", // вопрос сверху на кахаском
    },
    options: [
      // ответы
      {
        id: 1, // id - ответа
        topDescr: {
          ru: "Три в одном по всем традициям: Кудалык, Кыз Узату и Свадьба! ", // текст сверху на русском
          kz: "Барлық дәстүр бойынша үшеуі біреуде: Құдалық, Қыз ұзату және Үйлену тойы!", // текст сверху на кахаском
        },
        text: {
          ru: "Три в одном по всем традициям: Кудалык, Кыз Узату и Свадьба!", // текст самого вопроса на русском
          kz: "Барлық дәстүр бойынша үшеуі біреуде: Құдалық, Қыз ұзату және Үйлену тойы!", // текст самого вопроса на кахаском
        },
        image: {
          ru: "/images/q9_opt1.jpg",
          kz: "/images/q9_opt1.jpg",
        }, // картинка вопроса, папка с картинками тут /images
        value: 0, // стоимость вопроса
        messageTitle: {
          ru: "Три в одном по всем традициям: Кудалык, Кыз Узату и Свадьба!", // заголовок на странице ответа на русском
          kz: "Барлық дәстүр бойынша үшеуі біреуде: Құдалық, Қыз ұзату және Үйлену тойы!", // заголовок на странице ответа на кахаском
        },
        messageDescr: {
          ru: "Если делать свадьбу, то все по правилам.", // текст на странице ответа на русском
          kz: "Той жасағаннан кейін бәрі өз ретімен болуы керек.", // текст на странице ответа на кахаском
        },
      },
      {
        id: 2,
        topDescr: {
          ru: "Сделаем одну свадьбу и отложим на квартиру.",
          kz: "Бір той жасап, пәтерге ақша жинаймыз.",
        },
        text: {
          ru: "Сделаем одну свадьбу и отложим на квартиру.",
          kz: "Бір той жасап, пәтерге ақша жинаймыз.",
        },
        image: {
          ru: "/images/q9_opt2.jpg",
          kz: "/images/q9_opt2.jpg",
        },
        value: 900000,
        messageTitle: {
          ru: "Сделаем одну свадьбу и отложим на квартиру.",
          kz: "Бір той жасап, пәтерге ақша жинаймыз.",
        },
        messageDescr: {
          ru: "Может апа будет недовольна, но зато купим квартиру.",
          kz: "Апамыз риза болмауы мүмкін, есесіне пәтер сатып аламыз.",
        },
      },
      // {
      //   id: 3,
      //   topDescr: {
      //     ru: "Отложим на покупку квартиры в ЖК от BI Group",
      //     kz: "Таңертең жібек үйдеу",
      //   },
      //   text: {
      //     ru: "Отложим на покупку квартиры в ЖК от BI Group",
      //     kz: "Арзан жібек үйдеу",
      //   },
      //   image: "/images/image-message-1.png",
      //   value: 600000,
      //   messageTitle: {
      //     ru: "Отложим на покупку квартиры в ЖК от BI Group",
      //     kz: "Қандай киім таңдау керек?",
      //   },
      //   messageDescr: {
      //     ru: "Что может быть лучше чем новая квартира для новой семьи?",
      //     kz: "Қандай киім таңдау керек?",
      //   },
      // },
    ],
  },
];

export default questions;
